In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({"id":[1,2,3,4,5],
                   "name":["A","B","C","D","E"],
                   "DOJ":['01-05-2023','05-08-2022','06-02-2021','05-11-2025','04-03-2025']})

In [3]:
df

   id name         DOJ
0   1    A  01-05-2023
1   2    B  05-08-2022
2   3    C  06-02-2021
3   4    D  05-11-2025
4   5    E  04-03-2025

In [4]:
df.dtypes

id       int64
name    object
DOJ     object
dtype: object

In [6]:
df['DOJ_date'] = pd.to_datetime(df['DOJ'])

In [7]:
df

   id name         DOJ   DOJ_date
0   1    A  01-05-2023 2023-01-05
1   2    B  05-08-2022 2022-05-08
2   3    C  06-02-2021 2021-06-02
3   4    D  05-11-2025 2025-05-11
4   5    E  04-03-2025 2025-04-03

In [8]:
df.dtypes

id                   int64
name                object
DOJ                 object
DOJ_date    datetime64[ns]
dtype: object

In [10]:
df['month' ] =df['DOJ_date'].dt.month

In [11]:
df

   id name         DOJ   DOJ_date  month
0   1    A  01-05-2023 2023-01-05      1
1   2    B  05-08-2022 2022-05-08      5
2   3    C  06-02-2021 2021-06-02      6
3   4    D  05-11-2025 2025-05-11      5
4   5    E  04-03-2025 2025-04-03      4

In [13]:
  df['year']= df['DOJ_date'].dt.year

In [17]:
df['day']= df['DOJ_date'].dt.day

In [18]:
df

   id name         DOJ   DOJ_date  month  year  day
0   1    A  01-05-2023 2023-01-05      1  2023    5
1   2    B  05-08-2022 2022-05-08      5  2022    8
2   3    C  06-02-2021 2021-06-02      6  2021    2
3   4    D  05-11-2025 2025-05-11      5  2025   11
4   5    E  04-03-2025 2025-04-03      4  2025    3

In [42]:
df = pd.DataFrame({"id":[1,2,3,4,5],
                   "name":["A","B","C","D","E"],
                   "DOJ":['01st/May/2023','02nd/Jun/2023','04th/Dec/2023','07th/Mar/2023','02nd/Feb/2023']})

In [23]:
df['DOJ'].map({"st":'',"rd":'',"th":'',"nd":''})

0    NaN
1    NaN
2    NaN
3    NaN
4    NaN
Name: DOJ, dtype: object

In [43]:
df['DOJ'] = df['DOJ'].str.replace('st','')

In [46]:
df['DOJ'] = df['DOJ'].str.replace('th','')

In [47]:
df

   id name          DOJ
0   1    A  01/May/2023
1   2    B  02/Jun/2023
2   3    C  04/Dec/2023
3   4    D  07/Mar/2023
4   5    E  02/Feb/2023

In [ ]:
01/May/2023   --- '01-05-2023'

In [30]:
import calendar

In [49]:
df['DOJ_date'] =df['DOJ'].map(lambda x: x.split('/')[0]+"-"+str(datetime.strptime(x.split('/')[1], "%b").month)+"-"+x.split('/')[2])

In [50]:
df

   id name          DOJ    DOJ_date
0   1    A  01/May/2023   01-5-2023
1   2    B  02/Jun/2023   02-6-2023
2   3    C  04/Dec/2023  04-12-2023
3   4    D  07/Mar/2023   07-3-2023
4   5    E  02/Feb/2023   02-2-2023

In [60]:
df['test'] = pd.to_datetime(df['DOJ_date'],format='%d-%m-%Y')

In [61]:
df

   id name          DOJ    DOJ_date       test
0   1    A  01/May/2023   01-5-2023 2023-05-01
1   2    B  02/Jun/2023   02-6-2023 2023-06-02
2   3    C  04/Dec/2023  04-12-2023 2023-12-04
3   4    D  07/Mar/2023   07-3-2023 2023-03-07
4   5    E  02/Feb/2023   02-2-2023 2023-02-02

In [62]:
df = pd.read_csv("temp.csv")

In [63]:
df

    order_id customer region   product  quantity  price   sale_date
0          1    Alice  North    Laptop         1   1200  2024-01-05
1          2      Bob  South  Keyboard         3     40  2024-01-07
2          3  Charlie   East     Mouse         5     10  2024-01-08
3          4    Alice  North   Monitor         2    200  2024-01-10
4          5    David   West    Laptop         1   1300  2024-01-12
5          6      Eva  South     Mouse        10      8  2024-01-12
6          7    Frank  North     Mouse         2     12  2024-01-15
7          8    Alice   East  Keyboard         1     45  2024-01-16
8          9      Bob  South   Monitor         1    210  2024-01-17
9         10      Eva   West    Laptop         1   1400  2024-01-20
10        11  Charlie   East    Laptop         2   1250  2024-01-21
11        12    Frank  North  Keyboard         4     42  2024-01-22
12        13    Alice  South     Mouse         6      9  2024-01-23
13        14    David   West   Monitor         1    220  2024-01-25
14        15      Eva   East  Keyboard         3     38  2024-01-26

In [82]:
final = df.groupby(['product','region']).agg('price').sum()

In [90]:
pd.DataFrame(final).reset_index().groupby("

     product region  price
0   Keyboard   East     83
1   Keyboard  North     42
2   Keyboard  South     40
3     Laptop   East   1250
4     Laptop  North   1200
5     Laptop   West   2700
6    Monitor  North    200
7    Monitor  South    210
8    Monitor   West    220
9      Mouse   East     10
10     Mouse  North     12
11     Mouse  South     17